In [13]:
#merging 2 dataframes
import pandas as pd
var=pd.DataFrame({'name': ['John', 'Alice', 'Bob'], 'age': [25, 12,14]})
var2 = pd.DataFrame({'name': ['Alice', 'Bob', 'Charlie'], 'roll no': [12, 14, 16]})
pd.merge(var, var2)

    name  age  roll no
0  Alice   12       12
1    Bob   14       14

In [14]:
#to find the missdata and thus it can represent the missing 
pd.merge(var, var2, how="left")

    name  age  roll no
0   John   25      NaN
1  Alice   12     12.0
2    Bob   14     14.0

In [15]:
pd.merge(var, var2,how="right")

      name   age  roll no
0    Alice  12.0       12
1      Bob  14.0       14
2  Charlie   NaN       16

In [16]:
#shows all data, but fills in missing values with NaN
pd.merge(var, var2, how="outer",indicator=True)

      name   age  roll no      _merge
0    Alice  12.0     12.0        both
1      Bob  14.0     14.0        both
2  Charlie   NaN     16.0  right_only
3     John  25.0      NaN   left_only

In [19]:
#to show data only where both left and right have values
pd.merge(var, var2, left_index= True, right_index=True,suffixes=('_left', '_right'))

  name_left  age name_right  roll no
0      John   25      Alice       12
1     Alice   12        Bob       14
2       Bob   14    Charlie       16